package com.hero.ataa.data.remote.repositories

import com.hero.ataa.data.remote.models.requests.PayRequest
import com.hero.ataa.data.remote.models.responses.*
import com.hero.ataa.domain.models.Ad
import com.hero.ataa.domain.models.Project
import com.hero.ataa.domain.models.Receipt
import io.ktor.client.*
import javax.inject.Inject

private const val GET_ALL_PROJECTS_URL = "/m/projects"
private const val GET_PROJECTS_BY_TAG_URL = "/m/projects/"
private const val DONATE_URL = "/m/donate"
private const val RECEIPTS_URL = "/m/profile/donations"
private const val MISKEEN_URL = "/m/data/miskeen"
private const val SACRIFICE_URL = "/m/data/sacrifice"
private const val ADS_URL = "/m/projects/ads"

class ProjectsRepository @Inject constructor(
    private val httpClient: HttpClient
) {
    suspend fun getAds(): AdsResponse {
        /*
        return httpClient.get {
            url("${BASE_API_URL}${ADS_URL}")
        }.body()
         */
        return AdsResponse(
            ads = listOf(
                Ad(url = "https://i.postimg.cc/02SKx0cn/Hall-of-Fame-001.jpg", text = "Ataa"),
                Ad(url = "https://i.postimg.cc/02SKx0cn/Hall-of-Fame-001.jpg", text = "Ataa"),
                Ad(url = "https://i.postimg.cc/02SKx0cn/Hall-of-Fame-001.jpg", text = "Ataa"),
            )
        )
    }

    suspend fun getAllProjects(): ProjectsResponse {
        /*
        return httpClient.get {
            url("${BASE_API_URL}${GET_ALL_PROJECTS_URL}")
        }.body()
         */
        return ProjectsResponse(
            projects = listOf(
                Project(
                    title = "بناء مدرسة لذوي الاحتياجات الخاصة بمساحة 2000 م2",
                    tags = listOf("تعليم", "منشآت"),
                    imageUrl = "https://i.postimg.cc/02SKx0cn/Hall-of-Fame-001.jpg",
                    id = 0,
                    raisingGoal = 1000000000,
                    raised = 500000000,
                    location = "دمشق",
                    description = "التعليم هو المحرك الأساسي لبناء المجتمعات ونشأة الحضارات، ومن أهم العوامل التي تساعد على التطور. وبالتعليم أيضاً احتلت دول الصدارة في التنمية وفي مختلف مناحي الحياة. والأهم من ذلك كله هو أن التعليم حق من حقوق الإنسان الأساسية وهو الهدف الرابع من الأهداف الإنمائية للألفية التي وضعتها الأمم المتحدة واتفقت عليها بلدان العالم لتلبية احتياجات الفئات الأكثر هشاشة في جميع أنحاء العالم.",
                    goals = "التعليم هو المحرك الأساسي لبناء المجتمعات ونشأة الحضارات، ومن أهم العوامل التي تساعد على التطور. وبالتعليم أيضاً احتلت دول الصدارة في التنمية وفي مختلف مناحي الحياة. والأهم من ذلك كله هو أن التعليم حق من حقوق الإنسان الأساسية وهو الهدف الرابع من الأهداف الإنمائية للألفية التي وضعتها الأمم المتحدة واتفقت عليها بلدان العالم لتلبية احتياجات الفئات الأكثر هشاشة في جميع أنحاء العالم.",
                ),
                Project(
                    title = "بناء مدرسة لذوي الاحتياجات الخاصة بمساحة 2000 م2",
                    tags = listOf("تعليم", "منشآت"),
                    imageUrl = "https://i.postimg.cc/02SKx0cn/Hall-of-Fame-001.jpg",
                    id = 0,
                    raisingGoal = 1000000000,
                    raised = 500000000,
                    location = "دمشق",
                    description = "التعليم هو المحرك الأساسي لبناء المجتمعات ونشأة الحضارات، ومن أهم العوامل التي تساعد على التطور. وبالتعليم أيضاً احتلت دول الصدارة في التنمية وفي مختلف مناحي الحياة. والأهم من ذلك كله هو أن التعليم حق من حقوق الإنسان الأساسية وهو الهدف الرابع من الأهداف الإنمائية للألفية التي وضعتها الأمم المتحدة واتفقت عليها بلدان العالم لتلبية احتياجات الفئات الأكثر هشاشة في جميع أنحاء العالم.",
                    goals = "التعليم هو المحرك الأساسي لبناء المجتمعات ونشأة الحضارات، ومن أهم العوامل التي تساعد على التطور. وبالتعليم أيضاً احتلت دول الصدارة في التنمية وفي مختلف مناحي الحياة. والأهم من ذلك كله هو أن التعليم حق من حقوق الإنسان الأساسية وهو الهدف الرابع من الأهداف الإنمائية للألفية التي وضعتها الأمم المتحدة واتفقت عليها بلدان العالم لتلبية احتياجات الفئات الأكثر هشاشة في جميع أنحاء العالم.",
                ),
                Project(
                    title = "بناء مدرسة لذوي الاحتياجات الخاصة بمساحة 2000 م2",
                    tags = listOf("تعليم", "منشآت"),
                    imageUrl = "https://i.postimg.cc/02SKx0cn/Hall-of-Fame-001.jpg",
                    id = 0,
                    raisingGoal = 1000000000,
                    raised = 500000000,
                    location = "دمشق",
                    description = "التعليم هو المحرك الأساسي لبناء المجتمعات ونشأة الحضارات، ومن أهم العوامل التي تساعد على التطور. وبالتعليم أيضاً احتلت دول الصدارة في التنمية وفي مختلف مناحي الحياة. والأهم من ذلك كله هو أن التعليم حق من حقوق الإنسان الأساسية وهو الهدف الرابع من الأهداف الإنمائية للألفية التي وضعتها الأمم المتحدة واتفقت عليها بلدان العالم لتلبية احتياجات الفئات الأكثر هشاشة في جميع أنحاء العالم.",
                    goals = "التعليم هو المحرك الأساسي لبناء المجتمعات ونشأة الحضارات، ومن أهم العوامل التي تساعد على التطور. وبالتعليم أيضاً احتلت دول الصدارة في التنمية وفي مختلف مناحي الحياة. والأهم من ذلك كله هو أن التعليم حق من حقوق الإنسان الأساسية وهو الهدف الرابع من الأهداف الإنمائية للألفية التي وضعتها الأمم المتحدة واتفقت عليها بلدان العالم لتلبية احتياجات الفئات الأكثر هشاشة في جميع أنحاء العالم.",
                ),
                Project(
                    title = "بناء مدرسة لذوي الاحتياجات الخاصة بمساحة 2000 م2",
                    tags = listOf("تعليم", "منشآت"),
                    imageUrl = "https://i.postimg.cc/02SKx0cn/Hall-of-Fame-001.jpg",
                    id = 0,
                    raisingGoal = 1000000000,
                    raised = 500000000,
                    location = "دمشق",
                    description = "التعليم هو المحرك الأساسي لبناء المجتمعات ونشأة الحضارات، ومن أهم العوامل التي تساعد على التطور. وبالتعليم أيضاً احتلت دول الصدارة في التنمية وفي مختلف مناحي الحياة. والأهم من ذلك كله هو أن التعليم حق من حقوق الإنسان الأساسية وهو الهدف الرابع من الأهداف الإنمائية للألفية التي وضعتها الأمم المتحدة واتفقت عليها بلدان العالم لتلبية احتياجات الفئات الأكثر هشاشة في جميع أنحاء العالم.",
                    goals = "التعليم هو المحرك الأساسي لبناء المجتمعات ونشأة الحضارات، ومن أهم العوامل التي تساعد على التطور. وبالتعليم أيضاً احتلت دول الصدارة في التنمية وفي مختلف مناحي الحياة. والأهم من ذلك كله هو أن التعليم حق من حقوق الإنسان الأساسية وهو الهدف الرابع من الأهداف الإنمائية للألفية التي وضعتها الأمم المتحدة واتفقت عليها بلدان العالم لتلبية احتياجات الفئات الأكثر هشاشة في جميع أنحاء العالم.",
                ),
                Project(
                    title = "بناء مدرسة لذوي الاحتياجات الخاصة بمساحة 2000 م2",
                    tags = listOf("تعليم", "منشآت"),
                    imageUrl = "https://i.postimg.cc/02SKx0cn/Hall-of-Fame-001.jpg",
                    id = 0,
                    raisingGoal = 1000000000,
                    raised = 500000000,
                    location = "دمشق",
                    description = "التعليم هو المحرك الأساسي لبناء المجتمعات ونشأة الحضارات، ومن أهم العوامل التي تساعد على التطور. وبالتعليم أيضاً احتلت دول الصدارة في التنمية وفي مختلف مناحي الحياة. والأهم من ذلك كله هو أن التعليم حق من حقوق الإنسان الأساسية وهو الهدف الرابع من الأهداف الإنمائية للألفية التي وضعتها الأمم المتحدة واتفقت عليها بلدان العالم لتلبية احتياجات الفئات الأكثر هشاشة في جميع أنحاء العالم.",
                    goals = "التعليم هو المحرك الأساسي لبناء المجتمعات ونشأة الحضارات، ومن أهم العوامل التي تساعد على التطور. وبالتعليم أيضاً احتلت دول الصدارة في التنمية وفي مختلف مناحي الحياة. والأهم من ذلك كله هو أن التعليم حق من حقوق الإنسان الأساسية وهو الهدف الرابع من الأهداف الإنمائية للألفية التي وضعتها الأمم المتحدة واتفقت عليها بلدان العالم لتلبية احتياجات الفئات الأكثر هشاشة في جميع أنحاء العالم.",
                ),
                Project(
                    title = "بناء مدرسة لذوي الاحتياجات الخاصة بمساحة 2000 م2",
                    tags = listOf("تعليم", "منشآت"),
                    imageUrl = "https://i.postimg.cc/02SKx0cn/Hall-of-Fame-001.jpg",
                    id = 0,
                    raisingGoal = 1000000000,
                    raised = 500000000,
                    location = "دمشق",
                    description = "التعليم هو المحرك الأساسي لبناء المجتمعات ونشأة الحضارات، ومن أهم العوامل التي تساعد على التطور. وبالتعليم أيضاً احتلت دول الصدارة في التنمية وفي مختلف مناحي الحياة. والأهم من ذلك كله هو أن التعليم حق من حقوق الإنسان الأساسية وهو الهدف الرابع من الأهداف الإنمائية للألفية التي وضعتها الأمم المتحدة واتفقت عليها بلدان العالم لتلبية احتياجات الفئات الأكثر هشاشة في جميع أنحاء العالم.",
                    goals = "التعليم هو المحرك الأساسي لبناء المجتمعات ونشأة الحضارات، ومن أهم العوامل التي تساعد على التطور. وبالتعليم أيضاً احتلت دول الصدارة في التنمية وفي مختلف مناحي الحياة. والأهم من ذلك كله هو أن التعليم حق من حقوق الإنسان الأساسية وهو الهدف الرابع من الأهداف الإنمائية للألفية التي وضعتها الأمم المتحدة واتفقت عليها بلدان العالم لتلبية احتياجات الفئات الأكثر هشاشة في جميع أنحاء العالم.",
                ),
            )
        )
    }

    suspend fun getProjects(categoryApiKey: String): ProjectsResponse {
        /*
        return httpClient.get {
            url("${BASE_API_URL}${GET_PROJECTS_BY_TAG_URL}${categoryApiKey}")
        }.body()
         */
        return ProjectsResponse(
            projects = listOf(
                Project(
                    title = "بناء مدرسة لذوي الاحتياجات الخاصة بمساحة 2000 م2",
                    tags = listOf("تعليم", "منشآت"),
                    imageUrl = "https://i.postimg.cc/02SKx0cn/Hall-of-Fame-001.jpg",
                    id = 0,
                    raisingGoal = 1000000000,
                    raised = 500000000,
                    location = "دمشق",
                    description = "التعليم هو المحرك الأساسي لبناء المجتمعات ونشأة الحضارات، ومن أهم العوامل التي تساعد على التطور. وبالتعليم أيضاً احتلت دول الصدارة في التنمية وفي مختلف مناحي الحياة. والأهم من ذلك كله هو أن التعليم حق من حقوق الإنسان الأساسية وهو الهدف الرابع من الأهداف الإنمائية للألفية التي وضعتها الأمم المتحدة واتفقت عليها بلدان العالم لتلبية احتياجات الفئات الأكثر هشاشة في جميع أنحاء العالم.",
                    goals = "التعليم هو المحرك الأساسي لبناء المجتمعات ونشأة الحضارات، ومن أهم العوامل التي تساعد على التطور. وبالتعليم أيضاً احتلت دول الصدارة في التنمية وفي مختلف مناحي الحياة. والأهم من ذلك كله هو أن التعليم حق من حقوق الإنسان الأساسية وهو الهدف الرابع من الأهداف الإنمائية للألفية التي وضعتها الأمم المتحدة واتفقت عليها بلدان العالم لتلبية احتياجات الفئات الأكثر هشاشة في جميع أنحاء العالم.",
                ),
                Project(
                    title = "بناء مدرسة لذوي الاحتياجات الخاصة بمساحة 2000 م2",
                    tags = listOf("تعليم", "منشآت"),
                    imageUrl = "https://i.postimg.cc/02SKx0cn/Hall-of-Fame-001.jpg",
                    id = 0,
                    raisingGoal = 1000000000,
                    raised = 500000000,
                    location = "دمشق",
                    description = "التعليم هو المحرك الأساسي لبناء المجتمعات ونشأة الحضارات، ومن أهم العوامل التي تساعد على التطور. وبالتعليم أيضاً احتلت دول الصدارة في التنمية وفي مختلف مناحي الحياة. والأهم من ذلك كله هو أن التعليم حق من حقوق الإنسان الأساسية وهو الهدف الرابع من الأهداف الإنمائية للألفية التي وضعتها الأمم المتحدة واتفقت عليها بلدان العالم لتلبية احتياجات الفئات الأكثر هشاشة في جميع أنحاء العالم.",
                    goals = "التعليم هو المحرك الأساسي لبناء المجتمعات ونشأة الحضارات، ومن أهم العوامل التي تساعد على التطور. وبالتعليم أيضاً احتلت دول الصدارة في التنمية وفي مختلف مناحي الحياة. والأهم من ذلك كله هو أن التعليم حق من حقوق الإنسان الأساسية وهو الهدف الرابع من الأهداف الإنمائية للألفية التي وضعتها الأمم المتحدة واتفقت عليها بلدان العالم لتلبية احتياجات الفئات الأكثر هشاشة في جميع أنحاء العالم.",
                ),
                Project(
                    title = "بناء مدرسة لذوي الاحتياجات الخاصة بمساحة 2000 م2",
                    tags = listOf("تعليم", "منشآت"),
                    imageUrl = "https://i.postimg.cc/02SKx0cn/Hall-of-Fame-001.jpg",
                    id = 0,
                    raisingGoal = 1000000000,
                    raised = 500000000,
                    location = "دمشق",
                    description = "التعليم هو المحرك الأساسي لبناء المجتمعات ونشأة الحضارات، ومن أهم العوامل التي تساعد على التطور. وبالتعليم أيضاً احتلت دول الصدارة في التنمية وفي مختلف مناحي الحياة. والأهم من ذلك كله هو أن التعليم حق من حقوق الإنسان الأساسية وهو الهدف الرابع من الأهداف الإنمائية للألفية التي وضعتها الأمم المتحدة واتفقت عليها بلدان العالم لتلبية احتياجات الفئات الأكثر هشاشة في جميع أنحاء العالم.",
                    goals = "التعليم هو المحرك الأساسي لبناء المجتمعات ونشأة الحضارات، ومن أهم العوامل التي تساعد على التطور. وبالتعليم أيضاً احتلت دول الصدارة في التنمية وفي مختلف مناحي الحياة. والأهم من ذلك كله هو أن التعليم حق من حقوق الإنسان الأساسية وهو الهدف الرابع من الأهداف الإنمائية للألفية التي وضعتها الأمم المتحدة واتفقت عليها بلدان العالم لتلبية احتياجات الفئات الأكثر هشاشة في جميع أنحاء العالم.",
                ),
            )
        )
    }

    suspend fun getMiskeenValue(): ProjectValueResponse {
        /*
        return httpClient.get {
            url("${BASE_API_URL}${MISKEEN_URL}")
        }.body()
         */
        return ProjectValueResponse(projectValue = 10000)
    }

    suspend fun getSacrificeValue(): ProjectValueResponse {
        /*
        return httpClient.get {
            url("${BASE_API_URL}${SACRIFICE_URL}")
        }.body()
         */
        return ProjectValueResponse(projectValue = 900000)
    }

    suspend fun getReceipts(token: String): ReceiptsResponse {
        /*
        return httpClient.get {
            url("${BASE_API_URL}${RECEIPTS_URL}")
            header(HttpHeaders.Authorization, "Bearer $token")
        }.body()
         */
        return ReceiptsResponse(
            receipts = listOf(
                Receipt(
                    title = "بناء مدرسة لذوي الاحتياجات الخاصة بمساحة 2000 م2",
                    tags = listOf("تعليم", "منشآت"),
                    donationDate = "20/11/2016",
                    projectId = "0",
                    donationValue = 200000
                ),
                Receipt(
                    title = "بناء مدرسة لذوي الاحتياجات الخاصة بمساحة 2000 م2",
                    tags = listOf("تعليم", "منشآت"),
                    donationDate = "20/11/2016",
                    projectId = "0",
                    donationValue = 200000
                ),
                Receipt(
                    title = "بناء مدرسة لذوي الاحتياجات الخاصة بمساحة 2000 م2",
                    tags = listOf("تعليم", "منشآت"),
                    donationDate = "20/11/2016",
                    projectId = "0",
                    donationValue = 200000
                ),
            )
        )
    }

    suspend fun pay(token: String, payRequest: PayRequest): PayResponse {
        /*
        return httpClient.post {
            url("${BASE_API_URL}${DONATE_URL}")
            header(HttpHeaders.Authorization, "Bearer $token")
            setBody(payRequest)
        }.body()
         */
        return PayResponse(
            url = "https://www.facebook.com/ahmad.shahal.2001",
        )
    }
}